Revit 2026 API
Parameter.Set(Double) Method
Sets the parameter to a new real number value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public bool Set(
	double value
)
Public Function Set (
	value As Double
) As Boolean
public:
bool Set(
	double value
)
member Set :
        value : float -> bool
Parameters
value Double
The new double value to which the parameter is to be set.
Return Value
Boolean
The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | The parameter is read-only.
ArgumentException | Value must be a finite number.
Remarks
You should only use this method if the StorageType property reports the type of the parameter as a Double.
See Also
Reference
Parameter Class
Set Overload
Autodesk.Revit.DB Namespace